Revit 2027 API
IFCAggregateIterator.MoveNext Method
 Increments the iterator to the next object in the IFCAggregate.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool MoveNext()
Public Overridable Function MoveNext As Boolean
public:
virtual bool MoveNext()
abstract MoveNext : unit -> bool
override MoveNext : unit -> bool
Return Value
Boolean
 True if there is another available object in this iterator. False if the iterator has completed all available objects.
See Also
Reference
IFCAggregateIterator Class
Autodesk.Revit.DB.IFC Namespace